app/Controllers/Login_controller.php

SELECT *
FROM `usuarios`
WHERE `usuario` = 'administrador'
AND `baja` = 'NO'
ORDER BY `id` DESC
 LIMIT 1
---
    public function Auth()
    {
        $session = session();
        $model = new Usuarios_model();

        $usuario = $this->request->getVar('usuario');
        $password = $this->request->getVar('pass');

        // Busca el usuario en la base de datos
        $data = $model
            ->where('usuario', $usuario)
            ->where('baja', 'NO')  // solo usuarios activos
            ->orderBy('id', 'DESC')  // toma el más reciente
            ->first();