app/Controllers/Producto_controller.php

SELECT *
FROM `productos`
WHERE `id_producto` = 1
 LIMIT 1
SELECT *
FROM `categorias`
WHERE `id_categoria` = '1'
 LIMIT 1
SELECT *
FROM `marcas`
WHERE `id_marca` = '2'
 LIMIT 1
SELECT *
FROM `talles`
WHERE `id_talle` = '2'
 LIMIT 1
SELECT *
FROM `generos`
WHERE `id_genero` = '3'
 LIMIT 1
SELECT *
FROM `Edades`
WHERE `id_edad` = '1'
 LIMIT 1
---
    public function singleProducto($id = 1)
    {
        $productoModel = new Producto_model();

        $data['old'] = $productoModel->where('id_producto', $id)->first();

        if (empty($data['old'])) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('No se pudo encontrar el producto seleccionado');
        }

        $categoriasModel = new Categoria_model();
        $data['categorias'] = $categoriasModel->getCategorias();
        $data['categoriaActual'] = $categoriasModel->where('id_categoria', $data['old']['categoria_id'])->first();

        $marcaModel = new Marca_model();
        $data['marcas'] = $marcaModel->getMarcas();
        $data['marcaActual'] = $marcaModel->where('id_marca', $data['old']['marca_id'])->first();

        $talleModel = new Talle_model();
        $data['talles'] = $talleModel->getTalles();
        $data['talleActual'] = $talleModel->where('id_talle', $data['old']['talle_id'])->first();

        $generoModel = new Genero_model();
        $data['generos'] = $generoModel->getGeneros();
        $data['generoActual'] = $generoModel->where('id_genero', $data['old']['genero_id'])->first();

        $edadModel = new Edad_model();
        $data['edades'] = $edadModel->getedades();
        $data['edadActual'] = $edadModel->where('id_edad', $data['old']['edad_id'])->first();