app/Models/Categoria_model.php

SELECT *
FROM `categorias`
---
    public function getCategorias(){
        return $this->findAll();