app/Models/Genero_model.php

SELECT *
FROM `generos`
---
    public function getGeneros(){
        return $this->findAll();