app/Models/Marca_model.php

    public function getMarcas(){
        return $this->findAll();
---
SELECT *
FROM `marcas`