app/Models/Producto_Model.php

    public function getProductoAll()
    {
        return $this->where('eliminado', 0)->findAll();
---
SELECT *
FROM `productos`
WHERE `eliminado` = 0

    public function buscarProductos($buscar = null)
    {
        $builder = $this->where('eliminado', 'NO');

        if ($buscar) {
            $builder = $builder
                ->groupStart()
                    ->like('nombre_prod', $buscar)
                    ->orLike('precio_costo', $buscar)
                    ->orLike('precio_venta', $buscar)
                    ->orLike('stock', $buscar)
                ->groupEnd();
        }

        return $builder->findAll();
---
SELECT *
FROM `productos`
WHERE `eliminado` = 'NO'