app/Models/Talle_model.php

    public function getTalles(){
        return $this->findAll();
---
SELECT *
FROM `talles`